tsugli/stm32/common/rtos/portable/GCC/AT91SAM7S256/ioat91sam7s256.h
AT91C_PWMC_CH2_CUPDR      EQU (0xFFFCC250) ;- (PWMC_CH2) Channel Update Register
AT91C_PWMC_CH2_CPRDR      EQU (0xFFFCC248) ;- (PWMC_CH2) Channel Period Register
AT91C_PWMC_CH2_CMR        EQU (0xFFFCC240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_Reserved   EQU (0xFFFCC254) ;- (PWMC_CH2) Reserved
AT91C_PWMC_CH2_CCNTR      EQU (0xFFFCC24C) ;- (PWMC_CH2) Channel Counter Register
AT91C_PWMC_CH2_CDTYR      EQU (0xFFFCC244) ;- (PWMC_CH2) Channel Duty Cycle Register
// - ========== Register definition for PWMC_CH1 peripheral ========== 
AT91C_PWMC_CH1_CUPDR      EQU (0xFFFCC230) ;- (PWMC_CH1) Channel Update Register
AT91C_PWMC_CH1_CPRDR      EQU (0xFFFCC228) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_CMR        EQU (0xFFFCC220) ;- (PWMC_CH1) Channel Mode Register
AT91C_PWMC_CH1_Reserved   EQU (0xFFFCC234) ;- (PWMC_CH1) Reserved
AT91C_PWMC_CH1_CCNTR      EQU (0xFFFCC22C) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_CDTYR      EQU (0xFFFCC224) ;- (PWMC_CH1) Channel Duty Cycle Register
// - ========== Register definition for PWMC_CH0 peripheral ========== 
AT91C_PWMC_CH0_CUPDR      EQU (0xFFFCC210) ;- (PWMC_CH0) Channel Update Register
AT91C_PWMC_CH0_CPRDR      EQU (0xFFFCC208) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CMR        EQU (0xFFFCC200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_Reserved   EQU (0xFFFCC214) ;- (PWMC_CH0) Reserved
AT91C_PWMC_CH0_CCNTR      EQU (0xFFFCC20C) ;- (PWMC_CH0) Channel Counter Register
AT91C_PWMC_CH0_CDTYR      EQU (0xFFFCC204) ;- (PWMC_CH0) Channel Duty Cycle Register
// - ========== Register definition for PWMC peripheral ========== 
AT91C_PWMC_VR             EQU (0xFFFCC0FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_ISR            EQU (0xFFFCC01C) ;- (PWMC) PWMC Interrupt Status Register
AT91C_PWMC_IDR            EQU (0xFFFCC014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_SR             EQU (0xFFFCC00C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_ENA            EQU (0xFFFCC004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_IMR            EQU (0xFFFCC018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_MR             EQU (0xFFFCC000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_DIS            EQU (0xFFFCC008) ;- (PWMC) PWMC Disable Register
AT91C_PWMC_IER            EQU (0xFFFCC010) ;- (PWMC) PWMC Interrupt Enable Register
// - ========== Register definition for UDP peripheral ========== 
AT91C_UDP_TXVC            EQU (0xFFFB0074) ;- (UDP) Transceiver Control Register
AT91C_UDP_ISR             EQU (0xFFFB001C) ;- (UDP) Interrupt Status Register
AT91C_UDP_IDR             EQU (0xFFFB0014) ;- (UDP) Interrupt Disable Register
AT91C_UDP_CSR             EQU (0xFFFB0030) ;- (UDP) Endpoint Control and Status Register
AT91C_UDP_RSTEP           EQU (0xFFFB0028) ;- (UDP) Reset Endpoint Register
AT91C_UDP_ICR             EQU (0xFFFB0020) ;- (UDP) Interrupt Clear Register
AT91C_UDP_GLBSTATE        EQU (0xFFFB0004) ;- (UDP) Global State Register
AT91C_UDP_NUM             EQU (0xFFFB0000) ;- (UDP) Frame Number Register
AT91C_UDP_FADDR           EQU (0xFFFB0008) ;- (UDP) Function Address Register
AT91C_UDP_IER             EQU (0xFFFB0010) ;- (UDP) Interrupt Enable Register
AT91C_UDP_IMR             EQU (0xFFFB0018) ;- (UDP) Interrupt Mask Register
AT91C_UDP_FDR             EQU (0xFFFB0050) ;- (UDP) Endpoint FIFO Data Register

// - *****************************************************************************
// -               PIO DEFINITIONS FOR AT91SAM7S256
// - *****************************************************************************
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_PWM0            EQU (AT91C_PIO_PA0) ;-  PWM Channel 0
AT91C_PA0_TIOA0           EQU (AT91C_PIO_PA0) ;-  Timer Counter 0 Multipurpose Timer I/O Pin A
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_PWM1            EQU (AT91C_PIO_PA1) ;-  PWM Channel 1
AT91C_PA1_TIOB0           EQU (AT91C_PIO_PA1) ;-  Timer Counter 0 Multipurpose Timer I/O Pin B
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_DTXD           EQU (AT91C_PIO_PA10) ;-  DBGU Debug Transmit Data
AT91C_PA10_NPCS2          EQU (AT91C_PIO_PA10) ;-  SPI Peripheral Chip Select 2
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_NPCS0          EQU (AT91C_PIO_PA11) ;-  SPI Peripheral Chip Select 0
AT91C_PA11_PWM0           EQU (AT91C_PIO_PA11) ;-  PWM Channel 0
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_MISO           EQU (AT91C_PIO_PA12) ;-  SPI Master In Slave
AT91C_PA12_PWM1           EQU (AT91C_PIO_PA12) ;-  PWM Channel 1
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_MOSI           EQU (AT91C_PIO_PA13) ;-  SPI Master Out Slave
AT91C_PA13_PWM2           EQU (AT91C_PIO_PA13) ;-  PWM Channel 2
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_SPCK           EQU (AT91C_PIO_PA14) ;-  SPI Serial Clock
AT91C_PA14_PWM3           EQU (AT91C_PIO_PA14) ;-  PWM Channel 3
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_TF             EQU (AT91C_PIO_PA15) ;-  SSC Transmit Frame Sync
AT91C_PA15_TIOA1          EQU (AT91C_PIO_PA15) ;-  Timer Counter 1 Multipurpose Timer I/O Pin A
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_TK             EQU (AT91C_PIO_PA16) ;-  SSC Transmit Clock
AT91C_PA16_TIOB1          EQU (AT91C_PIO_PA16) ;-  Timer Counter 1 Multipurpose Timer I/O Pin B
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_TD             EQU (AT91C_PIO_PA17) ;-  SSC Transmit data
AT91C_PA17_PCK1           EQU (AT91C_PIO_PA17) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_RD             EQU (AT91C_PIO_PA18) ;-  SSC Receive Data
AT91C_PA18_PCK2           EQU (AT91C_PIO_PA18) ;-  PMC Programmable Clock Output 2
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_RK             EQU (AT91C_PIO_PA19) ;-  SSC Receive Clock
AT91C_PA19_FIQ            EQU (AT91C_PIO_PA19) ;-  AIC Fast Interrupt Input
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_PWM2            EQU (AT91C_PIO_PA2) ;-  PWM Channel 2
AT91C_PA2_SCK0            EQU (AT91C_PIO_PA2) ;-  USART 0 Serial Clock
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_RF             EQU (AT91C_PIO_PA20) ;-  SSC Receive Frame Sync
AT91C_PA20_IRQ0           EQU (AT91C_PIO_PA20) ;-  External Interrupt 0
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_RXD1           EQU (AT91C_PIO_PA21) ;-  USART 1 Receive Data
AT91C_PA21_PCK1           EQU (AT91C_PIO_PA21) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_TXD1           EQU (AT91C_PIO_PA22) ;-  USART 1 Transmit Data
AT91C_PA22_NPCS3          EQU (AT91C_PIO_PA22) ;-  SPI Peripheral Chip Select 3
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_SCK1           EQU (AT91C_PIO_PA23) ;-  USART 1 Serial Clock
AT91C_PA23_PWM0           EQU (AT91C_PIO_PA23) ;-  PWM Channel 0
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_RTS1           EQU (AT91C_PIO_PA24) ;-  USART 1 Ready To Send
AT91C_PA24_PWM1           EQU (AT91C_PIO_PA24) ;-  PWM Channel 1
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_CTS1           EQU (AT91C_PIO_PA25) ;-  USART 1 Clear To Send
AT91C_PA25_PWM2           EQU (AT91C_PIO_PA25) ;-  PWM Channel 2
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_DCD1           EQU (AT91C_PIO_PA26) ;-  USART 1 Data Carrier Detect
AT91C_PA26_TIOA2          EQU (AT91C_PIO_PA26) ;-  Timer Counter 2 Multipurpose Timer I/O Pin A
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_DTR1           EQU (AT91C_PIO_PA27) ;-  USART 1 Data Terminal ready
AT91C_PA27_TIOB2          EQU (AT91C_PIO_PA27) ;-  Timer Counter 2 Multipurpose Timer I/O Pin B
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_DSR1           EQU (AT91C_PIO_PA28) ;-  USART 1 Data Set ready
AT91C_PA28_TCLK1          EQU (AT91C_PIO_PA28) ;-  Timer Counter 1 external clock input
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_RI1            EQU (AT91C_PIO_PA29) ;-  USART 1 Ring Indicator
AT91C_PA29_TCLK2          EQU (AT91C_PIO_PA29) ;-  Timer Counter 2 external clock input
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_TWD             EQU (AT91C_PIO_PA3) ;-  TWI Two-wire Serial Data
AT91C_PA3_NPCS3           EQU (AT91C_PIO_PA3) ;-  SPI Peripheral Chip Select 3
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_IRQ1           EQU (AT91C_PIO_PA30) ;-  External Interrupt 1
AT91C_PA30_NPCS2          EQU (AT91C_PIO_PA30) ;-  SPI Peripheral Chip Select 2
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_NPCS1          EQU (AT91C_PIO_PA31) ;-  SPI Peripheral Chip Select 1
AT91C_PA31_PCK2           EQU (AT91C_PIO_PA31) ;-  PMC Programmable Clock Output 2
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_TWCK            EQU (AT91C_PIO_PA4) ;-  TWI Two-wire Serial Clock
AT91C_PA4_TCLK0           EQU (AT91C_PIO_PA4) ;-  Timer Counter 0 external clock input
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_RXD0            EQU (AT91C_PIO_PA5) ;-  USART 0 Receive Data
AT91C_PA5_NPCS3           EQU (AT91C_PIO_PA5) ;-  SPI Peripheral Chip Select 3
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_TXD0            EQU (AT91C_PIO_PA6) ;-  USART 0 Transmit Data
AT91C_PA6_PCK0            EQU (AT91C_PIO_PA6) ;-  PMC Programmable Clock Output 0
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_RTS0            EQU (AT91C_PIO_PA7) ;-  USART 0 Ready To Send
AT91C_PA7_PWM3            EQU (AT91C_PIO_PA7) ;-  PWM Channel 3
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_CTS0            EQU (AT91C_PIO_PA8) ;-  USART 0 Clear To Send
AT91C_PA8_ADTRG           EQU (AT91C_PIO_PA8) ;-  ADC External Trigger
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_DRXD            EQU (AT91C_PIO_PA9) ;-  DBGU Debug Receive Data
AT91C_PA9_NPCS1           EQU (AT91C_PIO_PA9) ;-  SPI Peripheral Chip Select 1

// - *****************************************************************************
// -               PERIPHERAL ID DEFINITIONS FOR AT91SAM7S256
// - *****************************************************************************
AT91C_ID_FIQ              EQU ( 0) ;- Advanced Interrupt Controller (FIQ)
AT91C_ID_SYS              EQU ( 1) ;- System Peripheral
AT91C_ID_PIOA             EQU ( 2) ;- Parallel IO Controller
AT91C_ID_3_Reserved       EQU ( 3) ;- Reserved
AT91C_ID_ADC              EQU ( 4) ;- Analog-to-Digital Converter
AT91C_ID_SPI              EQU ( 5) ;- Serial Peripheral Interface
AT91C_ID_US0              EQU ( 6) ;- USART 0
AT91C_ID_US1              EQU ( 7) ;- USART 1
AT91C_ID_SSC              EQU ( 8) ;- Serial Synchronous Controller
AT91C_ID_TWI              EQU ( 9) ;- Two-Wire Interface
AT91C_ID_PWMC             EQU (10) ;- PWM Controller
AT91C_ID_UDP              EQU (11) ;- USB Device Port
AT91C_ID_TC0              EQU (12) ;- Timer Counter 0
AT91C_ID_TC1              EQU (13) ;- Timer Counter 1
AT91C_ID_TC2              EQU (14) ;- Timer Counter 2
AT91C_ID_15_Reserved      EQU (15) ;- Reserved
AT91C_ID_16_Reserved      EQU (16) ;- Reserved
AT91C_ID_17_Reserved      EQU (17) ;- Reserved
AT91C_ID_18_Reserved      EQU (18) ;- Reserved
AT91C_ID_19_Reserved      EQU (19) ;- Reserved
AT91C_ID_20_Reserved      EQU (20) ;- Reserved
AT91C_ID_21_Reserved      EQU (21) ;- Reserved
AT91C_ID_22_Reserved      EQU (22) ;- Reserved
AT91C_ID_23_Reserved      EQU (23) ;- Reserved
AT91C_ID_24_Reserved      EQU (24) ;- Reserved
AT91C_ID_25_Reserved      EQU (25) ;- Reserved
AT91C_ID_26_Reserved      EQU (26) ;- Reserved
AT91C_ID_27_Reserved      EQU (27) ;- Reserved
AT91C_ID_28_Reserved      EQU (28) ;- Reserved
AT91C_ID_29_Reserved      EQU (29) ;- Reserved
AT91C_ID_IRQ0             EQU (30) ;- Advanced Interrupt Controller (IRQ0)
AT91C_ID_IRQ1             EQU (31) ;- Advanced Interrupt Controller (IRQ1)
AT91C_ALL_INT             EQU (0xC0007FF7) ;- ALL VALID INTERRUPTS

// - *****************************************************************************
// -               BASE ADDRESS DEFINITIONS FOR AT91SAM7S256
// - *****************************************************************************
AT91C_BASE_SYS            EQU (0xFFFFF000) ;- (SYS) Base Address
AT91C_BASE_AIC            EQU (0xFFFFF000) ;- (AIC) Base Address
AT91C_BASE_PDC_DBGU       EQU (0xFFFFF300) ;- (PDC_DBGU) Base Address
AT91C_BASE_DBGU           EQU (0xFFFFF200) ;- (DBGU) Base Address
AT91C_BASE_PIOA           EQU (0xFFFFF400) ;- (PIOA) Base Address
AT91C_BASE_CKGR           EQU (0xFFFFFC20) ;- (CKGR) Base Address
AT91C_BASE_PMC            EQU (0xFFFFFC00) ;- (PMC) Base Address
AT91C_BASE_RSTC           EQU (0xFFFFFD00) ;- (RSTC) Base Address
AT91C_BASE_RTTC           EQU (0xFFFFFD20) ;- (RTTC) Base Address
AT91C_BASE_PITC           EQU (0xFFFFFD30) ;- (PITC) Base Address
AT91C_BASE_WDTC           EQU (0xFFFFFD40) ;- (WDTC) Base Address
AT91C_BASE_VREG           EQU (0xFFFFFD60) ;- (VREG) Base Address
AT91C_BASE_MC             EQU (0xFFFFFF00) ;- (MC) Base Address
AT91C_BASE_PDC_SPI        EQU (0xFFFE0100) ;- (PDC_SPI) Base Address
AT91C_BASE_SPI            EQU (0xFFFE0000) ;- (SPI) Base Address
AT91C_BASE_PDC_ADC        EQU (0xFFFD8100) ;- (PDC_ADC) Base Address
AT91C_BASE_ADC            EQU (0xFFFD8000) ;- (ADC) Base Address
AT91C_BASE_PDC_SSC        EQU (0xFFFD4100) ;- (PDC_SSC) Base Address
AT91C_BASE_SSC            EQU (0xFFFD4000) ;- (SSC) Base Address
AT91C_BASE_PDC_US1        EQU (0xFFFC4100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0xFFFC4000) ;- (US1) Base Address
AT91C_BASE_PDC_US0        EQU (0xFFFC0100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0xFFFC0000) ;- (US0) Base Address
AT91C_BASE_TWI            EQU (0xFFFB8000) ;- (TWI) Base Address
AT91C_BASE_TC0            EQU (0xFFFA0000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0xFFFA0040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0xFFFA0080) ;- (TC2) Base Address
AT91C_BASE_TCB            EQU (0xFFFA0000) ;- (TCB) Base Address
AT91C_BASE_PWMC_CH3       EQU (0xFFFCC260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC_CH2       EQU (0xFFFCC240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH1       EQU (0xFFFCC220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH0       EQU (0xFFFCC200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC           EQU (0xFFFCC000) ;- (PWMC) Base Address
AT91C_BASE_UDP            EQU (0xFFFB0000) ;- (UDP) Base Address

// - *****************************************************************************
// -               MEMORY MAPPING DEFINITIONS FOR AT91SAM7S256
// - *****************************************************************************
// - ISRAM
AT91C_ISRAM               EQU (0x00200000) ;- Internal SRAM base address
AT91C_ISRAM_SIZE          EQU (0x00010000) ;- Internal SRAM size in byte (64 Kbytes)
// - IFLASH
AT91C_IFLASH              EQU (0x00100000) ;- Internal FLASH base address
AT91C_IFLASH_SIZE         EQU (0x00040000) ;- Internal FLASH size in byte (256 Kbytes)
AT91C_IFLASH_PAGE_SIZE    EQU (256) ;- Internal FLASH Page Size: 256 bytes
AT91C_IFLASH_LOCK_REGION_SIZE EQU (16384) ;- Internal FLASH Lock Region Size: 16 Kbytes
AT91C_IFLASH_NB_OF_PAGES  EQU (1024) ;- Internal FLASH Number of Pages: 1024 bytes
AT91C_IFLASH_NB_OF_LOCK_BITS EQU (16) ;- Internal FLASH Number of Lock Bits: 16 bytes
#endif /* __IAR_SYSTEMS_ASM__ */


#endif /* AT91SAM7S256_H */
